Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36032.svd
            <register>
               <name>REFO5CON</name>
               <description>REFERENCE OSCILLATOR 5 CONTROL REGISTER</description>
               <addressOffset>0xf0</addressOffset>
               <fields>
                  <field>
                     <name>ROSEL</name>
                     <description>Reference Clock Source Select bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ROSELSelect</name>
                        <enumeratedValue>
                           <name>REFCLKI</name>
                           <description>REFI Pin</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSCLK</name>
                           <description>System clock (reference clock reflects any device clock switching)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PBCLK1</name>
                           <description>Peripheral clock 1 (reference clock reflects any peripheral clock switching)</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL3</name>
                           <description>System PLL3 (Clock-3)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPRC</name>
                           <description>LPRC</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOSC</name>
                           <description>SOSC</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSC</name>
                           <description>POSC</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL1</name>
                           <description>System PLL1 (Clock-1)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRC</name>
                           <description>FRC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACTIVE</name>
                     <description>Reference Clock Request Status bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ACTIVESelect</name>
                        <enumeratedValue>
                           <name>ACTIVE</name>
                           <description>Reference clock request is active (User should not update this REFOCON register)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_ACTIVE</name>
                           <description>Reference clock request is not active (User can update this REFOCON register)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIVSWEN</name>
                     <description>Clock RODIV/ROTRIM switch enabled.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DIVSWENSelect</name>
                        <enumeratedValue>
                           <name>SWINPROGRESS</name>
                           <description>Clock Divider Switching currently in progress.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWCOMPLETE</name>
                           <description>Clock Divider Switch has completed.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSLP</name>
                     <description>Reference Oscillator Run in Sleep bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RSLPSelect</name>
                        <enumeratedValue>
                           <name>RSLP</name>
                           <description>Reference Oscillator output continues to run in Sleep</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_RSLP</name>
                           <description>Reference Oscillator output is disabled in Sleep</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Reference Clock Output Enable bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OESelect</name>
                        <enumeratedValue>
                           <name>REFO5_OE</name>
                           <description>Reference clock is driven out on REFO5 pin</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_REFO5_OE</name>
                           <description>Reference clock is not driven out on REFO5 pin.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIDL</name>
                     <description>Peripheral Stop in Idle Mode bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SIDLSelect</name>
                        <enumeratedValue>
                           <name>SIDL</name>
                           <description>Discontinue module operation when device enters Idle mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_SIDL</name>
                           <description>Continue module operation in Idle mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Freeze in Debug mode bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FRZSelect</name>
                        <enumeratedValue>
                           <name>FRZ</name>
                           <description>When emulator is in Debug mode, module freezes operation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_FRZ</name>
                           <description>When emulator is in Debug mode, module continues operation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ONSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Reference Oscillator Module enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Reference Oscillator Module disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RODIV</name>
                     <description>Reference Clock Divider bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>15</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RODIVSelect</name>
                        <enumeratedValue>
                           <name>65K</name>
                           <description>REFO5 clock is Base clock frequency divided by 65,534 (32,767 *2)</description>
                           <value>0x7fff</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RODIV_4</name>
                           <description>REFO5 clock is Base clock frequency divided by 4 (2*2)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RODIV_2</name>
                           <description>REFO5 clock is Base clock frequency divided by 2 (1*2)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>REFO5 clock is same frequency as Base clock (no divider)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>REFO5CONCLR</name>
               <addressOffset>0xf4</addressOffset>
            </register>
            <register>
               <name>REFO5CONSET</name>
               <addressOffset>0xf8</addressOffset>
            </register>
            <register>
               <name>REFO5CONINV</name>
               <addressOffset>0xfC</addressOffset>
            </register>
            <register>
               <name>REFO5TRIM</name>
               <description>REFERENCE OSCILLATOR 5 TRIM REGISTER</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>ROTRIM</name>
                     <description>Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>9</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ROTRIMSelect</name>
                        <enumeratedValue>
                           <name>ZERO</name>
                           <description>0/512 (0.0) divisor added to RODIV value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1/512 (0.001953125) divisor added to RODIV value</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2/512 (0.00390625) divisor added to RODIV value</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIM_256</name>
                           <description>256/512 (0.5000) divisor added to RODIV value</description>
                           <value>0x100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIM_512</name>
                           <description>511/512 (0.998046875) divisor added to RODIV value</description>
                           <value>0x1ff</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>REFO5TRIMCLR</name>
               <addressOffset>0x104</addressOffset>
            </register>
            <register>
               <name>REFO5TRIMSET</name>
               <addressOffset>0x108</addressOffset>
            </register>
            <register>
               <name>REFO5TRIMINV</name>
               <addressOffset>0x10C</addressOffset>
            </register>
