Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36032.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMT</name>
         <version>015201.0</version>
         <description>Dead Man Timer</description>
         <baseAddress>0x44000E00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x80</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DMTCON</name>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>ON</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMTPRECLR</name>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>STEP1</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMTCLR</name>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>STEP2</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMTSTAT</name>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>WINOPN</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMTEVENT</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAD2</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BAD1</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMTCNT</name>
               <addressOffset>0x40</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNTER</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMTHOLDREG</name>
               <addressOffset>0x50</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UPRCNT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMTPSCNT</name>
               <addressOffset>0x60</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PSCNT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMTPSINTV</name>
               <addressOffset>0x70</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PSINTV</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMTCONCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x4</addressOffset>
            </register>
            <register>
               <name>DMTCONSET</name>
               <description>Bit set register</description>
               <addressOffset>0x8</addressOffset>
            </register>
            <register>
               <name>DMTCONINV</name>
               <description>Bit invert register</description>
               <addressOffset>0xc</addressOffset>
            </register>
            <register>
               <name>DMTPRECLRCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x14</addressOffset>
            </register>
            <register>
               <name>DMTPRECLRSET</name>
               <description>Bit set register</description>
               <addressOffset>0x18</addressOffset>
            </register>
            <register>
               <name>DMTPRECLRINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x1c</addressOffset>
            </register>
            <register>
               <name>DMTCLRCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x24</addressOffset>
            </register>
            <register>
               <name>DMTCLRSET</name>
               <description>Bit set register</description>
               <addressOffset>0x28</addressOffset>
            </register>
            <register>
               <name>DMTCLRINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x2c</addressOffset>
            </register>
            <register>
               <name>DMTSTATCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x34</addressOffset>
            </register>
            <register>
               <name>DMTSTATSET</name>
               <description>Bit set register</description>
               <addressOffset>0x38</addressOffset>
            </register>
            <register>
               <name>DMTSTATINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x3c</addressOffset>
            </register>
            <register>
               <name>DMTCNTCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x44</addressOffset>
            </register>
            <register>
               <name>DMTCNTSET</name>
               <description>Bit set register</description>
               <addressOffset>0x48</addressOffset>
            </register>
            <register>
               <name>DMTCNTINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x4c</addressOffset>
            </register>
            <register>
               <name>DMTHOLDREGCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x54</addressOffset>
            </register>
            <register>
               <name>DMTHOLDREGSET</name>
               <description>Bit set register</description>
               <addressOffset>0x58</addressOffset>
            </register>
            <register>
               <name>DMTHOLDREGINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x5c</addressOffset>
            </register>
            <register>
               <name>DMTPSCNTCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x64</addressOffset>
            </register>
            <register>
               <name>DMTPSCNTSET</name>
               <description>Bit set register</description>
               <addressOffset>0x68</addressOffset>
            </register>
            <register>
               <name>DMTPSCNTINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x6c</addressOffset>
            </register>
            <register>
               <name>DMTPSINTVCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x74</addressOffset>
            </register>
            <register>
               <name>DMTPSINTVSET</name>
               <description>Bit set register</description>
               <addressOffset>0x78</addressOffset>
            </register>
            <register>
               <name>DMTPSINTVINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x7c</addressOffset>
            </register>
