Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36032.svd
            <register>
               <name>RSWRST</name>
               <description>SOFTWARE RESET REGISTER</description>
               <addressOffset>0x40</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset Trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SWRSTSelect</name>
                        <enumeratedValue>
                           <name>SWRST</name>
                           <description>Enable software reset event</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_SWRST</name>
                           <description>Do not enable software reset event</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSWRSTCLR</name>
               <addressOffset>0x44</addressOffset>
            </register>
            <register>
               <name>RSWRSTSET</name>
               <addressOffset>0x48</addressOffset>
            </register>
            <register>
               <name>RSWRSTINV</name>
               <addressOffset>0x4C</addressOffset>
            </register>
            <register>
               <name>RNMICON</name>
               <description>NMI CONTROL REGISTER</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>NMICNT</name>
                     <description>NMI Reset counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>NMICNTSelect</name>
                        <enumeratedValue>
                           <name>NODLY</name>
                           <description>No delay between NMI assertion and device reset event</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1CLKDLY</name>
                           <description>1 sys_clk cycle that Software has to clear the NMI event before a device reset is performed.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2CLKDLY</name>
                           <description>2 sys_clk cycles that Software has to clear the NMI event before a device reset is performed.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64KCLKDLY</name>
                           <description>65535 sys_clk cycles that Software has to clear the NMI event before a device reset is performed.</description>
                           <value>0xffff</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDTS</name>
                     <description>Watch-Dog Timer Time-Out in Sleep Flag bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WDTSSelect</name>
                        <enumeratedValue>
                           <name>WDTS</name>
                           <description>WDT Time-out has occurred during sleep_mode and caused a wake-up from sleep.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_WDTS</name>
                           <description>WDT Time-out has not occurred during sleep_mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CF</name>
                     <description>Clock Fail Detect bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CFSelect</name>
                        <enumeratedValue>
                           <name>CFAIL</name>
                           <description>FSCM has detected clock failure and caused an NMI</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_FAILDET</name>
                           <description>FSCM has not detected clock failure</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LVD</name>
                     <description>Programmable Low Voltage Detect Event</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>LVDSelect</name>
                        <enumeratedValue>
                           <name>LVD</name>
                           <description>PLVD has detected a low voltage condition and caused an NMI</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_LVD</name>
                           <description>PLVD has not detected a low voltage condition</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GNMI</name>
                     <description>External / Generic NMI Event</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>GNMISelect</name>
                        <enumeratedValue>
                           <name>NMI</name>
                           <description>A general NMI event has been detected and caused an NMI</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_NMI</name>
                           <description>A general NMI event has not been detected.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWNMI</name>
                     <description>Software NMI Trigger</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SWNMISelect</name>
                        <enumeratedValue>
                           <name>SWNMI</name>
                           <description>Writing a 1 to this bit will cause an NMI to be generated</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_SWNMI</name>
                           <description>Writing a 0 to this bit will have no effect.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDTR</name>
                     <description>Watchdog Timer Time-Out in Run Flag bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WDTRSelect</name>
                        <enumeratedValue>
                           <name>WDTR</name>
                           <description>WDT Time-out has occurred and caused a NMI.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_WDTR</name>
                           <description>WDT Time-out has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMTO</name>
                     <description>Deadman Timer Time-Out Flag bit</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DMTOSelect</name>
                        <enumeratedValue>
                           <name>DMTO</name>
                           <description>DMT Time-out has occurred and caused a NMI.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_DMTO</name>
                           <description>DMT Time-out has not occurred.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNMICONCLR</name>
               <addressOffset>0x54</addressOffset>
            </register>
            <register>
               <name>RNMICONSET</name>
               <addressOffset>0x58</addressOffset>
            </register>
            <register>
               <name>RNMICONINV</name>
               <addressOffset>0x5C</addressOffset>
            </register>
