Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36032.svd
            <register>
               <name>EFUSE_CON</name>
               <description>Efuse Configuration Register2</description>
               <addressOffset>0xC08</addressOffset>
               <fields>
                  <field>
                     <name>PGM_1BIT</name>
                     <description>eFuse CTRL to program 1 bit at a time. Valid only when EN_PGM is set</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PGM_1BITSelect</name>
                        <enumeratedValue>
                           <name>EFUSE_RW_15_0</name>
                           <description>EFuse controller will program EFUSE_RWDATA.DATA[15:0] to the address in EFUSE_RWDATA.ADDR[11:3]</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EFUSE_RW_0</name>
                           <description>EFuse controller will program EFUSE_RWDATA.DATA[0] to the address in EFUSE_RWDATA.ADDR[11:0]</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PGM_MODE</name>
                     <description>eFuse Programming Mode Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PGM_MODESelect</name>
                        <enumeratedValue>
                           <name>PGM_MODE_DISABLED</name>
                           <description>EFuse Programming disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PGM_MODE_ENABLED</name>
                           <description>EFuse Programming enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_LD</name>
                     <description>eFuse Word Read Start bit for loading the fuse byte pointed by ADDR field into the holding register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EN_LDSelect</name>
                        <enumeratedValue>
                           <name>ENLD_READ_COMPLETED</name>
                           <description>EFuse Read operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENLD_READ_START</name>
                           <description>Start eFuse Read operation for specified eFuse word as addressed in EFUSE_RWDATA register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_LD_ALL1</name>
                     <description>eFuse Panel Read Start bit for loading into the holding registers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EN_LD_ALL1Select</name>
                        <enumeratedValue>
                           <name>ENLD_ALL1_READ_COMPLETED</name>
                           <description>EFuse Read operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENLD_ALL1_READ_START</name>
                           <description>Start eFuse Read operation for entire eFuse panel</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN_PGM</name>
                     <description>eFuse Programming Start bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EN_PGMSelect</name>
                        <enumeratedValue>
                           <name>EN_PGM_COMPLETED</name>
                           <description>EFuse Programming operation has completed</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN_PGM_START</name>
                           <description>Start eFuse Programming operation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
